{
  "reviews": [
              {
                "Name": "Karlea Hartley",
                "Comment": "Best company there is out there!!  Check it out!",
                "Star Rating Value": 5
              },
              {
                "Name": "Paula Muller",
                "Comment": "Chase did an excellent job and workmanship fixing my furnace.  I am most impressed.  Excellent quality work, quick to schedule and very reasonable rates.  I highly recommend Chase for your furnace and cooling repairs and maintenance.",
                "Star Rating Value": 5
              },
              {
                "Name": "Seth Walker",
                "Comment": "Chase is great and does awesome work!",
                "Star Rating Value": 5
              },
              {
                "Name": "Melissa Sayyah",
                "Comment": "Chase is great! So glad we found him. He was honest and very knowledgeable. Took the time to answer all our questions too. I’ve had contractors that have left a mess for me to clean up. Chase was so respectful and cleaned up so well that  you would never even know he had been there except for the brand new furnace that works great. I definitely recommend chase!",
                "Star Rating Value": 5
              },
              {
                "Name": "Makia Hites",
                "Comment": "Chase was amazing hands down best experience I've ever had having to deal with someone doing work on my house. I was very overwhelmed with the things that I needed done most places that I had called just said this is how much it is and that's it. Chase went above and beyond making sure I understood what I needed and why and walked me through the whole process and answered all the questions that I had. This made me feel comfortable knowing why I needed the things I did and it showed his knowledge and understanding that he had for his job. I'll never call anyone else and will forever recommend elevate heating & cooling.",
                "Star Rating Value": 5
              },
              {
                "Name": "Joe Adney",
                "Comment": "Chase was awesome. Communicated with me a number of times this week to confirm everything. Also send a text when he was on his way and was here right on time. The work was done well and the price was very reasonable.",
                "Star Rating Value": 5
              },
              {
                "Name": "Tricia Ball",
                "Comment": "Chase was great! Answered the phone promptly and scheduled my service within a couple days. He showed up on time, was professional. We will use and recommend him again!",
                "Star Rating Value": 5
              },
              {
                "Name": "Tanya Acevedo",
                "Comment": "Excellent and quick service to get our air conditioner back up and running in one of the hottest days of the year. Highly recommend! Thanks Chase!!",
                "Star Rating Value": 5
              },
              {
                "Name": "Laurence Cox",
                "Comment": "Excellent experience from start to finish. Highly recommended!",
                "Star Rating Value": 5
              },
              {
                "Name": "Willy Allen",
                "Comment": "Friendly, quick, prompt, caring, listens, gets it done.",
                "Star Rating Value": 5
              },
              {
                "Name": "Antonino Gutierrez",
                "Comment": "Had a great experience with Chase diagnosing a well outdated furnace and found the parts! Would recommend.",
                "Star Rating Value": 5
              },
              {
                "Name": "Scott Sayyah",
                "Comment": "I highly recommend chase! Great guy. I’m a contractor myself and was very impressed with his professionalism and knowledge. I have a large house and our old unit didn’t heat our house evenly. He  recommended a heating unit that he said would do the job and it’s amazing. I am so glad I found Chase at Elevate! Highly recommend!",
                "Star Rating Value": 5
              },
              {
                "Name": "jason specht",
                "Comment": "Installed the best system we could ever imagine.  Extremely knowledgeable outfit. We will utilize their services again.  Highly recommended.",
                "Star Rating Value": 5
              },
              {
                "Name": "Claire Weakley",
                "Comment": "Its hard to find a reliable, trustworthy contractor that does honest work. With Elevate Heating, you get it all! Definitely recommend 👍🏼 10/10",
                "Star Rating Value": 5
              },
              {
                "Name": "Travis Willson",
                "Comment": "Knowledgeable and timely service that you can trust at a fair price. I will use them again!",
                "Star Rating Value": 5
              },
              {
                "Name": "Colleen Pedey",
                "Comment": "the service was easy to schedule, on time and efficient.  I received a thorough explanation of the service provided, the particular details of the condition of my furnace and my questions were answered During the process.  I also received ideas for better efficiency.  I will be scheduling a tune up for my central air whe the weather permits.",
                "Star Rating Value": 5
              },
              {
                "Name": "Nolan Knox",
                "Comment": "Very professional and quick to respond to my call. He was able to help me figure out what I needed to do for my furnace and what I needed to do setup wise for future AC that would require minimal work later.",
                "Star Rating Value": 5
              },
              {
                "Name": "Eleanor Gorman",
                "Comment": "We're happy to have found Elevate Heating & Cooling to inspect our home heating system and provide certification for the sale of our home. Chase was wonderful to work with; professional, knowledgeable, thorough and friendly.  We highly recommend Chase and Elevate!",
                "Star Rating Value": 5
              }
  ]
}