[
    {
    "By": "Steve C. in Portland, OR",
    "Stars": "★★★★★",
    "Project": "Project: Repair Natural Gas or Propane Furnace / Forced Air Heating System",
    "Review": "Chase arrived on time and did a great job. He explained all that he was doing. Will definitely use him again for our HVAC needs and would highly recommend"
    },
    {
    "By": "Jamie S. in Hillsboro, OR",
    "Stars": "★★★★★",
    "Project": "Project: Repair Natural Gas or Propane Furnace / Forced Air Heating System ",
    "Review": "Chase was fantastic! He communicated well what the issues were, clearly explained my options and the cost, and worked quickly to repair the problem. I'd recommend him to anyone!"
    },
    {
    "By": "Mariko P. in Beaverton, OR",
    "Stars": "★★★★★",
    "Project": "Project: Repair Natural Gas or Propane Furnace / Forced Air Heating System ",
    "Review": "Chase did a great job installing our 95% energy efficient furnace yesterday. It is so quiet and we love it. It helps my allergy since it brings new fresh air from outside. It gives us tax credit. It is also much safer than our old furnace. Why didn't we replace it earlier? My husband and I are satisfied with his work 100%. Thank you, Chase!"
    },
    {
    "By": "John M. in Portland, OR",
    "Stars": "★★★★★",
    "Project": "Project: Repair Natural Gas or Propane Furnace / Forced Air Heating System ",
    "Review": "As a Realtor, I have worked with a number of HVAC companies. Without a doubt, this is one of the best. Fantastic service, great prices, friendly and prompt communication. I’ll definitely be recommending Elevate to all of my clients."
    },
    {
    "By": "Annie M. in Hillsboro, OR",
    "Stars": "★★★★★",
    "Project": "Project: Repair Natural Gas or Propane Furnace / Forced Air Heating System ",
    "Review": "Chase, our Elevate service technician discovered a dangerous DIY install on the furnace. He explained everything in detail, repaired the damaged gas line, and prepared the entire air/heat system for winter. Aside from potentially saving our lives, he was kind enough to let me follow him around asking questions so I could learn how it all works. Thank you Chase!"
    },
    {
    "By": "Annie M. in Hillsboro, OR",
    "Stars": "★★★★★",
    "Project": "Project: Repair Natural Gas or Propane Furnace / Forced Air Heating System ",
    "Review": "Chase, our Elevate service technician discovered a dangerous DIY install on the furnace. He explained everything in detail, repaired the damaged gas line, and prepared the entire air/heat system for winter. Aside from potentially saving our lives, he was kind enough to let me follow him around asking questions so I could learn how it all works. Thank you Chase!"
    },
    {
    "By": "Mccallester D. in Hillsboro, OR",
    "Stars": "★★★★★",
    "Project": "Project: Repair or Service a Central Air Conditioning System ",
    "Review": "Great service! You can tell Chase really cares about the job he does and his customers. Professional, thorough, thoughtful, clean. Will definitely use Elevate again."
    },
    {
    "By": "Mccallester D. in Hillsboro, OR",
    "Stars": "★★★★★",
    "Project": "Project: Repair or Service a Central Air Conditioning System ",
    "Review": "Great service! You can tell Chase really cares about the job he does and his customers. Professional, thorough, thoughtful, clean. Will definitely use Elevate again."
    },
    {
    "By": "Jennifer W. in Forest Grove, OR",
    "Stars": "★★★★★",
    "Project": "Project: Repair Electric Furnace / Forced Air Heating System ",
    "Review": "Chase arrived on time and did a great job. He was good at explaining what my options were and cleaned the unit. It was a great experience and I would recommend Elevate Heating and Cooling to anyone!"
    },
    {
        "By": "Ken K. in Beaverton, OR",
        "Stars": "★★★★★",
        "Project": "Project: Repair or Service a Central Air Conditioning System  ",
        "Review": "Easy to work with. Excellent workmanship."
    },
    {
        "By": "Gene B. in Beaverton, OR",
        "Stars": "★★★★★",
        "Project": "Project: Repair or Service a Central Air Conditioning System ",
        "Review": "Chase was very responsive and personable. He responded first of all vendors to my request for service and completed the job more quickly than I expected it would be done. His price was reasonable and fair. He was patient and thorough in his explanation of what the job entailed. I would recommend him to others."
    },
    {
        "By": "Shelley P. in Hillsboro, OR",
        "Stars": "★★★★★",
        "Project": "Project: Repair or Service a Central Air Conditioning System ",
        "Review": "I was very impressed by the rig that the service technician showed up in. There was a pull behind trailer full of his tools and parts. Chase was on time and this was even a same day service! My A/C unit had been cooling fine but overnight the units fan stopped turning and no cool air was coming out. The outside unit was also hot to touch on top. Chase checked it out and quickly determined it was 2 parts that I needed. After 15 minutes he came back and said it was blowing cold air again and I actually only needed 1 part. Chase also checked out my furnace to make sure it was operating correctly. Chase was very knowledgeable and even had shoe covers so he wouldn't track on my floor! Very professional and I plan to use him again."
    }
]